package main

import "fmt"

/*******************************************************************************************************************************************
 * 엄밀히 말하면 튜플은 여러 부분으로 구성된, 크기가 유한한 순서 리스트이다.
 * Go언어는 튜플 타입을 직접 지원하진 않는다.
 * 그러나 멀티반환 함수 등에서 튜플을 계속 사용해왔었음
*******************************************************************************************************************************************/

func returnThree(x int) (a int, b int, c int) {
	return 2 * x, 2 + x, x - 2
}

func main() {
	fmt.Println(returnThree(10))
	n1, n2, n3 := returnThree((20))
	fmt.Println(n1, n2, n3)
}
