/**************************************************************************************************************************************
 *플래그란 프로그램의 동작을 제어하려고 전달하는 옵션으로, 특정한 포맷으로 된 스트링 값으로 표현됨.
**************************************************************************************************************************************/

package main

import (
	"flag"
	"fmt"
)

func main() {
	minusK := flag.Bool("k", true, "k flag")
	minusO := flag.Int("O", 1, "O")
	flag.Parse()

	valueK := *minusK
	valueO := *minusO
	valueO++

	fmt.Println("-k:", valueK)
	fmt.Println("-O:", valueO)
}
